'use strict';
/*
Неправильные ответы: 16
REST API это -
    Ваш ответ
Описание методов передачи данных по протоколу http(s)
JSON.parse(JSON.stringify(object)) вернет
Ваш ответ
Массив свойств переданного объекта
Какое значение переменной found после выполнения кода
Ваш ответ
Исполнение кода выдаст ошибку, т.к.ищем по классу, а передаем значение идентификатора
Что выведет в консоли следующий код:
Ваш ответ
Выйдет ошибка выполнения, т.к.не указан метод запроса
Какое утверждение верное ?
    Ваш ответ
Метод map возвращает полностью новый массив
Что означает запись функции:
Ваш ответ
Функция принимает на вход массив из трех элементов и записывает значения в переменные a, b, c
Какое высказывание справедливо для классов при наследовании ?
    Ваш ответ
Чтобы использовать методы класса - родителя, надо их переопределить
Как прописать в классе People подсчет количества человек ?
    Ваш ответ
В самом классе никак, надо создать отдельную переменную и там хранить количество
Какое сравнение двух дат правильное ?

    Ваш ответ
date1.equal(date2)

Ваш ответ
Сделать полное сравнение по составляющим дат(getFullYear(), getMonth(), getDate() и т.д.)

Ваш ответ
date1 < date2

Ваш ответ
date1.getTime() < date2.getTime()

const a = undefined;

Какое сравнение даст истину ?

    Ваш ответ
a == undefined
Ваш ответ
a === null
Ваш ответ
a == null
В каком случае можно использовать then после catch при работе с промисами ?
    Ваш ответ
Если catch выдает внутреннюю ошибку
Как задать 1 января 2019 года ?
    Ваш ответ
new Date(2019, 1, 1, 0, 0, 0)
Что делает метод document.onload ?
    Ваш ответ
Показывает процесс загрузки страницы
Какой формат передачи данных предусмотрен между клиентом и сервером ?
    Ваш ответ
JSON
В результате выполнения кода

const cities = ['Moscow', 'Paris', 'Berlin', 'London'];

const city = […cities];

получится:  

Ваш ответ
Массив city, который является тем же массивом cities, т.к.присвоение массивов — это присвоение лишь ссылок
Часто встречается такая конструкция:



promise.then(code 1).then(code 2).catch(code 3)

 

Какие могут быть последовательности исполнения кода ?

    Ваш ответ
code 1, затем code 2, затем code 3
*/